Repository: cunyjschool/NYC-Tracks
Catalog: lang/gazette-*.po
Languages: ro_ro

source: Older Entries &raquo;
ro_ro: Articole mai vechi &raquo;

source: % Comments
ro_ro: % Comentarii

source: % Responses
ro_ro: % Răspunsuri

source: &laquo; Newer Entries
ro_ro: &laquo; Articole mai noi

source: 0 Comments
ro_ro: 0 Comentarii

source: 1 Comment
ro_ro: 1 Comentariu

source: <span class="continue">Continue Reading</span>
ro_ro: <span class="continue">Continua să citeşti</span>

source: Added on
ro_ro: Adăugat la

source: Advert
ro_ro: Publicitate

source: Archive
ro_ro: Arhivă

source: Author Archives
ro_ro: Arhiva autorilor

source: Categories
ro_ro: Categorii

source: Categorized
ro_ro: Clasificat

source: Comments
ro_ro: Comentarii

source: Comments
ro_ro: Comentarii

source: Currently Playing...
ro_ro: Acum rulează...

source: Direct link to this comment
ro_ro: Legătură către acest comentariu

source: Enter search keyword
ro_ro: Introduceţi cuvântul căutat

source: Featured Stories
ro_ro: Accente

source: Go
ro_ro: Mergi

source: Home
ro_ro: Prima pagină

source: Latest
ro_ro: Ultimele

source: Leave a Reply
ro_ro: Scrie un răspuns

source: Leave a Reply to %s
ro_ro: Scrie un răspuns pentru %

source: Log out of this account
ro_ro: Ieşire din cont

source: Logout &raquo;
ro_ro: Ieşire &raquo;

source: Mail (will not be published)
ro_ro: eMail (nu va fi publicat)

source: Monthly Archives
ro_ro: Arhive lunare

source: Name
ro_ro: Nume

source: No Responses
ro_ro: Fără răspunsuri

source: None Found
ro_ro: Nimic găsit

source: One Response
ro_ro: Un răspuns

source: Page Not Found!
ro_ro: Pagina nu a fost găsită!

source: Pages
ro_ro: Pagini

source: Permalink to
ro_ro: Legătură către

source: Permalink to
ro_ro: Legătură către

source: Permanent Link to
ro_ro: Legătură către

source: Photos on
ro_ro: Imagini pe

source: Popular Tags
ro_ro: Taguri Populare

source: Posted in
ro_ro: Publicat în

source: Posted in
ro_ro: Publicat în

source: Posted on
ro_ro: Publicat la

source: Posted on
ro_ro: Publicat la

source: Powered by
ro_ro: Rulează

source: Read the full story
ro_ro: Citeşte întregul articol

source: Search Results
ro_ro: Rezultatele căutării

source: Sorry, but the page you were looking for is not here.
ro_ro: Ne pare rău, pagina pe care o căutaţi nu este aici.

source: Sorry. Your search yielded no results. Please search again.
ro_ro: Ne pare rău. Căutarea nu a avut nici un rezultat. Vă rugăm încercaţi din nou.

source: Submit Comment
ro_ro: Publică un comentariu

source: Subscribe
ro_ro: Subscrie

source: Subscribe to the RSS feed
ro_ro: Subscrie la feed-ul RSS

source: Subscribe to the feed via email
ro_ro: Subscrie la feed prin email

source: Tag Archive
ro_ro: Arhiva tag-urilor

source: Tags
ro_ro: Tag

source: The Last 30 Posts
ro_ro: Ultimele 30 de articole

source: This post is password protected. Enter the password to view comments.
ro_ro: Acest articol este protejat prin parolă. Introduceţi parola pentru a vedea comentariile.

source: This post was written by:
ro_ro: Acest articol a fost scris de:

source: View More Videos
ro_ro: Vezi mai multe clipuri

source: Website
ro_ro: Site

source: Your comment is awaiting moderation
ro_ro: Comentariul dumneavoastră urmează a fi moderat

source: by
ro_ro: de

source: to
ro_ro: către
